#include <iostream>
#include <random>
using namespace std;

int main() {
    string map[11][11] {{" "," "," "," "," "," "," "," "," "," "," "},
                        {" "," "," ","█","█","█","█","█"," "," "," "},
                        {" "," ","█"," "," "," "," "," ","█"," "," "},
                        {" ","█"," "," ","█","█","█"," "," ","█"," "},
                        {" ","█"," ","█"," "," "," ","█"," ","█"," "},
                        {" ","█"," ","█"," ","█"," ","█"," ","█"," "},
                        {" ","█"," ","█"," "," "," ","█"," ","█"," "},
                        {" ","█"," "," ","█","█","█"," "," ","█"," "},
                        {" "," ","█"," "," "," "," "," ","█"," "," "},
                        {" "," "," ","█","█","█","█","█"," "," "," "},
                        {" "," "," "," "," "," "," "," "," "," "," "}

    }; // ▚ - символ выстрела

    int x, y;
    int points = 0; // сумма очков

    mt19937 gen;                   // магия генерации псевдо рандомных чисел
    gen.seed(time(0));

    for(int a = 0; a <= 10; a++){      // отрисовка
        for(int b = 0; b <= 10; b++){
            cout << map[a][b] << " ";
        }
        cout << endl;
    }
    cout << endl;

    for (int i = 0; i < 5; i++){
        cout << "Введите координаты X и Y от -5 до 5 для "<< i + 1 <<" выстрела: ";
        cin >> x >> y;
        x += gen() % 6;    // симуляция криворукости 
        x -= gen() % 6;
        y += gen() % 6;
        y -= gen() % 6;

        if (abs(x) <= 5 && abs(y) <= 5) {        // обрабока попадания
            points += 5 - max(abs(x), abs(y));
            map[5 + x][5 + y] = "0";
        } else cout << "MISS" << endl;

        for(int a = 0; a <= 10; a++){      // отрисовка
            for(int b = 0; b <= 10; b++){
                cout << map[a][b] << " ";
            }
            cout << endl;
        }

        cout << "Попадание в координату: " << x << " " << y << endl;
        cout << "Ваши очки: " << points << endl << endl;
    }
    cout << "Ваши очки: " << points << endl;
    if (points < 10) cout << "LOSER!";
    else cout << "WIN!";

    return 0;
}
